[
    {
        "favoredBy": "Brian Kernighan",
        "title": "Finding Me",
        "author": "Viola Davis",
        "genre": "Fiction",
        "synopsis": "In my book, you will meet a little girl named Viola who ran from her past until she made a life-changing decision to stop running forever.\n\nThis is my story, from a crumbling apartment in Central Falls, Rhode Island, to the stage in New York City, and beyond. This is the path I took to finding my purpose but also my voice in a world that didn't always see me.\n\nAs I wrote Finding Me, my eyes were open to the truth of how our stories are often not given close examination. We are forced to reinvent them to fit into a crazy, competitive, judgmental world. So I wrote this for anyone running through life untethered, desperate and clawing their way through murky memories, trying to get to some form of self-love. For anyone who needs reminding that a life worth living can only be born from radical honesty and the courage to shed facades and be . . . you.\n\nFinding Me is a deep reflection, a promise, and a love letter of sorts to self. My hope is that my story will inspire you to light up your own life with creative expression and rediscover who you were before the world put a label on you.",
        "publisher": "Publishing House"
    },
    {
        "favoredBy": "Max Kanat-Alexander",
        "title": "I'm Glad My Mom Died",
        "author": "Jennette McCurdy",
        "genre": "Fiction",
        "synopsis": "A heartbreaking and hilarious memoir by iCarly and Sam & Cat star Jennette McCurdy about her struggles as a former child actor—including eating disorders, addiction, and a complicated relationship with her overbearing mother—and how she retook control of her life.\n\nJennette McCurdy was six years old when she had her first acting audition. Her mother's dream was for her only daughter to become a star, and Jennette would do anything to make her mother happy. So she went along with what Mom called \"calorie restriction,\" eating little and weighing herself five times a day. She endured extensive at-home makeovers while Mom chided, \"Your eyelashes are invisible, okay? You think Dakota Fanning doesn't tint hers?\" She was even showered by Mom until age sixteen while sharing her diaries, email, and all her income.\n\nIn I'm Glad My Mom Died, Jennette recounts all this in unflinching detail—just as she chronicles what happens when the dream finally comes true. Cast in a new Nickelodeon series called iCarly, she is thrust into fame. Though Mom is ecstatic, emailing fan club moderators and getting on a first-name basis with the paparazzi (\"Hi Gale!\"), Jennette is riddled with anxiety, shame, and self-loathing, which manifest into eating disorders, addiction, and a series of unhealthy relationships. These issues only get worse when, soon after taking the lead in the iCarly spinoff Sam & Cat alongside Ariana Grande, her mother dies of cancer. Finally, after discovering therapy and quitting acting, Jennette embarks on recovery and decides for the first time in her life what she really wants.",
        "publisher": "Publishing House"
    },
    {
        "favoredBy": "Why The Lucky Stiff",
        "title": "Love Life",
        "author": "Rob Lowe",
        "genre": "Fiction",
        "synopsis": "When Rob Lowe's first book was published in 2011, he received the kind of rapturous reviews that writers dream of and rocketed to the top of the bestseller list. Now, in Love Life, he expands his scope, using stories and observations from his life in a poignant and humorous series of true tales about men and women, art and commerce, fathers and sons, addiction and recovery, and sex and love.\n\nIn Love Life, you will find stories about:\n\n• Kissing Unexpectedly\n• The secrets they don't teach you in acting school\n• His great, great, great, great, great-grandfather's role in the American revolution\n• Parks and Recreation, Behind the Candelabra, and Californication\n• Trying to coach a kids' basketball team dominated by helicopter parents\n• The hot tub at the Playboy mansion\n• Starring in and producing a flop tv series\n• Camping at Sea World\n• Playing saxophone for president Bill Clinton\n• The first journey to college with his son\n• Warren Beatty\n• The benefits of marriage",
        "publisher": "Publishing House"
    },
    {
        "favoredBy": "Kent Beck",
        "title": "Born Standing Up: A Comic's Life",
        "author": "Steve Martin",
        "genre": "Fiction",
        "synopsis": "In the midseventies, Steve Martin exploded onto the comedy scene. By 1978 he was the biggest concert draw in the history of stand-up. In 1981 he quit forever. This book is, in his own words, the story of \"why I did stand-up and why I walked away.\"\n\nEmmy and Grammy Award winner, author of the acclaimed New York Times bestsellers Shopgirl and The Pleasure of My Company, and a regular contributor to The New Yorker, Martin has always been a writer. His memoir of his years in stand-up is candid, spectacularly amusing, and beautifully written.\n\nAt age ten Martin started his career at Disneyland, selling guidebooks in the newly opened theme park. In the decade that followed, he worked in the Disney magic shop and the Bird Cage Theatre at Knott's Berry Farm, performing his first magic/comedy act a dozen times a week. The story of these years, during which he practiced and honed his craft, is moving and revelatory. The dedication to excellence and innovation is formed at an astonishingly early age and never wavers or wanes.\n\nMartin illuminates the sacrifice, discipline, and originality that made him an icon and informs his work to this day. To be this good, to perform so frequently, was isolating and lonely. It took Martin decades to reconnect with his parents and sister, and he tells that story with great tenderness. Martin also paints a portrait of his times-the era of free love and protests against the war in Vietnam, the heady irreverence of The Smothers Brothers Comedy Hour in the late sixties, and the transformative new voice of Saturday Night Live in the seventies.",
        "publisher": "Publishing House"
    },
    {
        "favoredBy": "Edward V. Berard",
        "title": "The Story of My Life",
        "author": "Helen Keller",
        "genre": "Fiction",
        "synopsis": "When she was 19 months old, Helen Keller (1880–1968) suffered a severe illness that left her blind and deaf. Not long after, she also became mute. Her tenacious struggle to overcome these handicaps-with the help of her inspired teacher, Anne Sullivan-is one of the great stories of human courage and dedication. In this classic autobiography, first published in 1903, Miss Keller recounts the first 22 years of her life, including the magical moment at the water pump when, recognizing the connection between the word \"water\" and the cold liquid flowing over her hand, she realized that objects had names. Subsequent experiences were equally noteworthy: her joy at eventually learning to speak, her friendships with Oliver Wendell Holmes, Edward Everett Hale and other notables, her education at Radcliffe (from which she graduated cum laude), and-underlying all-her extraordinary relationship with Miss Sullivan, who showed a remarkable genius for communicating with her eager and quick-to-learn pupil.",
        "publisher": "Publishing House"
    },
    {
        "favoredBy": "Alan Kay",
        "title": "I Know Why the Caged Bird Sings",
        "author": "Maya Angelou",
        "genre": "Fiction",
        "synopsis": "Maya Angelou's debut memoir is a modern American classic beloved worldwide. Her life story is told in the documentary film And Still I Rise, as seen on PBS's American Masters.\n\nHere is a book as joyous and painful, as mysterious and memorable, as childhood itself. I Know Why the Caged Bird Sings captures the longing of lonely children, the brute insult of bigotry, and the wonder of words that can make the world right. Maya Angelou's debut memoir is a modern American classic beloved worldwide.\n\nSent by their mother to live with their devout, self-sufficient grandmother in a small Southern town, Maya and her brother, Bailey, endure the ache of abandonment and the prejudice of the local \"powhitetrash.\" At eight years old and back at her mother's side in St. Louis, Maya is attacked by a man many times her age—and has to live with the consequences for a lifetime. Years later, in San Francisco, Maya learns that love for herself, the kindness of others, her own strong spirit, and the ideas of great authors (\"I met and fell in love with William Shakespeare\") will allow her to be free instead of imprisoned.\n\nPoetic and powerful, I Know Why the Caged Bird Sings will touch hearts and change minds for as long as people read.",
        "publisher": "Publishing House"
    },
    {
        "favoredBy": "C.A.R. Hoare",
        "title": "The Autobiography of Malcolm X",
        "author": "Malcolm X, Alex Haley",
        "genre": "Fiction",
        "synopsis": "Through a life of passion and struggle, Malcolm X became one of the most influential figures of the 20th Century. In this riveting account, he tells of his journey from a prison cell to Mecca, describing his transition from hoodlum to Muslim minister. Here, the man who called himself \"the angriest Black man in America\" relates how his conversion to true Islam helped him confront his rage and recognize the brotherhood of all mankind.\n\nAn established classic of modern America, \"The Autobiography of Malcolm X\" was hailed by the New York Times as \"Extraordinary. A brilliant, painful, important book.\" Still extraordinary, still important, this electrifying story has transformed Malcolm X's life into his legacy. The strength of his words, and the power of his ideas continue to resonate more than a generation after they first appeared.",
        "publisher": "Publishing House"
    },
    {
        "favoredBy": "David Thomas",
        "title": "Friends, Lovers, and the Big Terrible Thing",
        "author": "Matthew Perry, Lisa Kudrow (Foreword)",
        "genre": "Fiction",
        "synopsis": "\"Hi, my name is Matthew, although you may know me by another name. My friends call me Matty. And I should be dead.\"\n\nSo begins the riveting story of acclaimed actor Matthew Perry, taking us along on his journey from childhood ambition to fame to addiction and recovery in the aftermath of a life-threatening health scare. Before the frequent hospital visits and stints in rehab, there was five-year-old Matthew, who traveled from Montreal to Los Angeles, shuffling between his separated parents; fourteen-year-old Matthew, who was a nationally ranked tennis star in Canada; twenty-four-year-old Matthew, who nabbed a coveted role as a lead cast member on the talked-about pilot then called Friends Like Us. . . and so much more.\n\nIn an extraordinary story that only he could tell—and in the heartfelt, hilarious, and warmly familiar way only he could tell it—Matthew Perry lays bare the fractured family that raised him (and also left him to his own devices), the desire for recognition that drove him to fame, and the void inside him that could not be filled even by his greatest dreams coming true. But he also details the peace he's found in sobriety and how he feels about the ubiquity of Friends, sharing stories about his castmates and other stars he met along the way. Frank, self-aware, and with his trademark humor, Perry vividly depicts his lifelong battle with addiction and what fueled it despite seemingly having it all.\n\nFriends, Lovers, and the Big Terrible Thing is an unforgettable memoir that is both intimate and eye-opening—as well as a hand extended to anyone struggling with sobriety. Unflinchingly honest, moving, and uproariously funny, this is the book fans have been waiting for.",
        "publisher": "Publishing House"
    },
    {
        "favoredBy": "Donald Knuth",
        "title": "Eat, Pray, Love",
        "author": "Elizabeth Gilbert",
        "genre": "Fiction",
        "synopsis": "A celebrated writer's irresistible, candid, and eloquent account of her pursuit of worldly pleasure, spiritual devotion, and what she really wanted out of life.\n\nAround the time Elizabeth Gilbert turned thirty, she went through an early-onslaught midlife crisis. She had everything an educated, ambitious American woman was supposed to want—a husband, a house, a successful career. But instead of feeling happy and fulfilled, she was consumed with panic, grief, and confusion. She went through a divorce, a crushing depression, another failed love, and the eradication of everything she ever thought she was supposed to be.\n\nTo recover from all this, Gilbert took a radical step. In order to give herself the time and space to find out who she really was and what she really wanted, she got rid of her belongings, quit her job, and undertook a yearlong journey around the world—all alone. Eat, Pray, Love is the absorbing chronicle of that year. Her aim was to visit three places where she could examine one aspect of her own nature set against the backdrop of a culture that has traditionally done that one thing very well. In Rome, she studied the art of pleasure, learning to speak Italian and gaining the twenty-three happiest pounds of her life. India was for the art of devotion, and with the help of a native guru and a surprisingly wise cowboy from Texas, she embarked on four uninterrupted months of spiritual exploration. In Bali, she studied the art of balance between worldly enjoyment and divine transcendence. She became the pupil of an elderly medicine man and also fell in love the best way—unexpectedly.\n\nAn intensely articulate and moving memoir of self-discovery, Eat, Pray, Love is about what can happen when you claim responsibility for your own contentment and stop trying to live in imitation of society's ideals. It is certain to touch anyone who has ever woken up to the unrelenting need for change.",
        "publisher": "Publishing House"
    },
    {
        "favoredBy": "Lernantino",
        "title": "The Woman in Me",
        "author": "Britney Spears",
        "genre": "Fiction",
        "synopsis": "In June 2021, the whole world was listening as Britney Spears spoke in open court. The impact of sharing her voice—her truth—was undeniable, and it changed the course of her life and the lives of countless others. The Woman in Me reveals for the first time her incredible journey—and the strength at the core of one of the greatest performers in pop music history.\n\nWritten with remarkable candor and humor, Spears's groundbreaking book illuminates the enduring power of music and love—and the importance of a woman telling her own story, on her own terms, at last.",
        "publisher": "Publishing House"
    }
]